Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
_terms_post: Refreshing state... [id=agm-ay7zxbuce5-5soaxl-POST]
module.sbeacon.aws_api_gateway_method.map: Refreshing state... [id=agm-ay7zxbuce5-wrl7bg-GET]
module.sbeacon.aws_api_gateway_method.individuals: Refreshing state... [id=agm-ay7zxbuce5-rojf3g-GET]
module.sbeacon.aws_api_gateway_method.dportal_proxy: Refreshing state... [id=agm-ay7zxbuce5-50q97k-ANY]
module.sbeacon.aws_api_gateway_method.analyses-filtering_terms_post: Refreshing state... [id=agm-ay7zxbuce5-lkcvxt-POST]
module.sbeacon.aws_api_gateway_method.datasets: Refreshing state... [id=agm-ay7zxbuce5-ykp4c4-GET]
module.sbeacon.aws_api_gateway_method.runs-id-g_variants: Refreshing state... [id=agm-ay7zxbuce5-90ijb7-GET]
module.sbeacon.aws_api_gateway_method.datasets-id-g_variants: Refreshing state... [id=agm-ay7zxbuce5-gblm3a-GET]
module.sbeacon.aws_api_gateway_method.individuals_post: Refreshing state... [id=agm-ay7zxbuce5-rojf3g-POST]
module.sbeacon.aws_api_gateway_method.admin_proxy: Refreshing state... [id=agm-ay7zxbuce5-9dk56a-ANY]
module.sbeacon.aws_api_gateway_method.biosamples-id-analyses: Refreshing state... [id=agm-ay7zxbuce5-a2e61n-GET]
module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post: Refreshing state... [id=agm-ay7zxbuce5-a2mxdc-POST]
module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post: Refreshing state... [id=agm-ay7zxbuce5-36rzlr-POST]
module.sbeacon.aws_api_gateway_method.runs: Refreshing state... [id=agm-ay7zxbuce5-3rhrn1-GET]
module.sbeacon.aws_api_gateway_method.runs-filtering_terms: Refreshing state... [id=agm-ay7zxbuce5-azek1i-GET]
module.sbeacon.aws_api_gateway_method.analyses-filtering_terms: Refreshing state... [id=agm-ay7zxbuce5-lkcvxt-GET]
module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post: Refreshing state... [id=agm-ay7zxbuce5-azek1i-POST]
module.sbeacon.aws_api_gateway_method.biosamples-id: Refreshing state... [id=agm-ay7zxbuce5-rf4u1t-GET]
module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post: Refreshing state... [id=agm-ay7zxbuce5-1hngs5-POST]
module.sbeacon.aws_api_gateway_method.individuals-id-g_variants: Refreshing state... [id=agm-ay7zxbuce5-nutc2v-GET]
module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post: Refreshing state... [id=agm-ay7zxbuce5-ndrfug-POST]
module.sbeacon.aws_api_gateway_method.runs-id-analyses: Refreshing state... [id=agm-ay7zxbuce5-ciik3o-GET]
module.sbeacon.aws_api_gateway_method.biosamples-id-runs: Refreshing state... [id=agm-ay7zxbuce5-87mkua-GET]
module.sbeacon.aws_api_gateway_method.biosamples: Refreshing state... [id=agm-ay7zxbuce5-qas2rf-GET]
module.sbeacon.aws_api_gateway_method.analyses_post: Refreshing state... [id=agm-ay7zxbuce5-qryfoo-POST]
module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post: Refreshing state... [id=agm-ay7zxbuce5-inzuhj-POST]
module.sbeacon.aws_api_gateway_method.datasets-id_post: Refreshing state... [id=agm-ay7zxbuce5-ywlhni-POST]
module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment: Refreshing state... [id=gaspi-admin-group-role-20250526052003563400000002]
module.cognito.aws_cognito_user_group.admin_group: Refreshing state... [id=ap-southeast-3_aosNqJwGI/administrators]
module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment: Refreshing state... [id=gaspi-manager-group-role-20250526052002853400000001]
module.cognito.aws_cognito_user_group.manager_group: Refreshing state... [id=ap-southeast-3_aosNqJwGI/managers]
module.cognito.aws_iam_role_policy.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated:unauthenticated_policy]
module.svep[0].aws_api_gateway_integration.results-get: Refreshing state... [id=agi-osb9nvt4q0-r7yeta-GET]
module.svep[0].aws_lambda_permission.get_results_invoke_permission: Refreshing state... [id=APIGetResultsAllowInvoke]
module.svep[0].aws_lambda_permission.cloudwatch_update_reference_files_invoke_permission: Refreshing state... [id=CloudwatchUpdateReferenceFilesAllowInvoke]
module.svep[0].aws_lambda_permission.sns_update_reference_files_invoke_permission: Refreshing state... [id=SNSUpdateReferenceFilesAllowInvoke]
module.svep[0].aws_cloudwatch_event_target.update_references_trigger: Refreshing state... [id=svep_update_references_trigger-lambda-updateReferenceFiles]
module.svep[0].aws_lambda_function_recursion_config.update_reference_files_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.updateReferenceFiles: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-updateReferenceFiles:4d33fcc6-711c-47e3-8a4f-b40eada9a2f8]
module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.create_pages_invoke_permission: Refreshing state... [id=SNSCreatePagesAllowInvoke]
module.svep[0].aws_sns_topic_subscription.createPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-createPages:21e5fcaa-9496-41b8-bc7b-8cc0a547cbf4]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission: Refreshing state... [id=SNSSendJobEmailAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginGnomad: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-pluginGnomad:16011883-0b69-4c19-92ce-93c5c7442e38]
module.svep[0].aws_sns_topic_subscription.sendJobEmail: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-sendJobEmail:ef837adb-51bb-4621-8942-811373f82b80]
module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.queryVCF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-queryVCF:f57734c9-c9b5-47e4-85cd-3bd8f6b05ef1]
module.svep[0].aws_lambda_permission.query_vcf_invoke_permission: Refreshing state... [id=SNSQueryVCFAllowInvoke]
module.svep[0].aws_lambda_permission.concat_invoke_permission: Refreshing state... [id=SNSConcatAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concat: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-concat:23cddf53-5042-42ce-b995-58e68824d567]
module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission: Refreshing state... [id=SNSQueryVCFSubmitAllowInvoke]
module.svep[0].aws_lambda_permission.concat_pages_invoke_permission: Refreshing state... [id=SNSConcatPagesAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryVCFsubmit: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-queryVCFsubmit:bd4221be-8724-4eaf-aca5-121e2532ad0d]
module.svep[0].aws_sns_topic_subscription.concatPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-concatPages:f8e084fd-dd0b-4b7a-be91-c3b9a9dbc43d]
module.svep[0].aws_sns_topic_subscription.formatOutput: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-formatOutput:c08e3f80-43ac-4fe8-b099-752fdaad190f]
module.svep[0].aws_lambda_permission.formatOutput_invoke_permission: Refreshing state... [id=SNSformatOutputAllowInvoke]
module.svep[0].aws_api_gateway_integration.vcfstats-post: Refreshing state... [id=agi-osb9nvt4q0-pthst5-POST]
module.svep[0].aws_api_gateway_integration.vcfstats-patch: Refreshing state... [id=agi-osb9nvt4q0-pthst5-PATCH]
module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission: Refreshing state... [id=APIVcfstatsAllowInvoke]
module.svep[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-osb9nvt4q0-hf7iq3-PATCH]
module.svep[0].aws_lambda_permission.init_query_invoke_permission: Refreshing state... [id=APIInitQueryAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission: Refreshing state... [id=SNSPluginClinvarAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.init_query_recursion: Refreshing state...
module.svep[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-osb9nvt4q0-hf7iq3-POST]
module.svep[0].aws_sns_topic_subscription.pluginClinvar: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-pluginClinvar:60f51f80-21fb-4cd8-92a8-ac2c1dadb88d]
module.cognito.aws_iam_role_policy.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated:authenticated_policy]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Refreshing state... [id=ap-southeast-3:927d379f-df30-4ed1-937c-e8a82f3b9408]
module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryVCF]
module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-pluginGnomad]
module.svep[0].aws_lambda_permission.query_gtf_invoke_permission: Refreshing state... [id=SNSQueryGTFAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.queryGTF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-queryGTF:7a2e4fca-e60e-488b-99e5-578e030cc66b]
module.svep[0].module.lambda-formatOutput.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-formatOutput]
module.svep[0].module.lambda-concat.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concat]
module.svep[0].aws_sns_topic_subscription.concatStarter: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-concatStarter:9e325ff5-781e-4dd0-8fd7-7aabbcaf3ce9]
module.svep[0].aws_lambda_permission.concat_starter_invoke_permission: Refreshing state... [id=SNSConcatStarterAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion: Refreshing state...
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs]
module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginConsequence]
module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryGTF]
module.svep[0].module.lambda-concatPages.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concatPages]
module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryVCFsubmit]
module.svep[0].module.lambda-concatStarter.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concatStarter]
module.svep[0].module.lambda-initQuery.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-initQuery]
module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-sendJobEmail]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post: Refreshing state... [id=agmr-ay7zxbuce5-87mkua-POST-200]
module.sbeacon.aws_api_gateway_method_response.entry_types: Refreshing state... [id=agmr-ay7zxbuce5-nj6imq-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples: Refreshing state... [id=agmr-ay7zxbuce5-36rzlr-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-nutc2v-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-zy2tj8-POST-200]
module.svep[0].module.lambda-pluginClinvar.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-pluginClinvar]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ay7zxbuce5-ciik3o-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ay7zxbuce5-xvn5i1-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-gblm3a-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs_post: Refreshing state... [id=agmr-ay7zxbuce5-3rhrn1-POST-200]
module.sbeacon.aws_api_gateway_method_response.info: Refreshing state... [id=agmr-ay7zxbuce5-i68a93-GET-200]
module.sbeacon.aws_api_gateway_method_response.root-get: Refreshing state... [id=agmr-ay7zxbuce5-bvg5rk8ca5-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants: Refreshing state... [id=agmr-ay7zxbuce5-zy2tj8-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id_post: Refreshing state... [id=agmr-ay7zxbuce5-3wwe9g-POST-200]
module.svep[0].module.lambda-createPages.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-createPages]
module.sbeacon.aws_api_gateway_method_response.configuration: Refreshing state... [id=agmr-ay7zxbuce5-70wedb-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id: Refreshing state... [id=agmr-ay7zxbuce5-9f6czs-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals: Refreshing state... [id=agmr-ay7zxbuce5-k9hee7-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id_post: Refreshing state... [id=agmr-ay7zxbuce5-cibxn6-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-90ijb7-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post: Refreshing state... [id=agmr-ay7zxbuce5-a2e61n-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post: Refreshing state... [id=agmr-ay7zxbuce5-kf5n4v-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-xvn5i1-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post: Refreshing state... [id=agmr-ay7zxbuce5-x2xtxj-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-xvn5i1-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id_post: Refreshing state... [id=agmr-ay7zxbuce5-9f6czs-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id: Refreshing state... [id=agmr-ay7zxbuce5-cibxn6-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples: Refreshing state... [id=agmr-ay7zxbuce5-x2xtxj-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses: Refreshing state... [id=agmr-ay7zxbuce5-qryfoo-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples: Refreshing state... [id=agmr-ay7zxbuce5-kf5n4v-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-1hngs5-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id_post: Refreshing state... [id=agmr-ay7zxbuce5-e0naw4-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants: Refreshing state... [id=agmr-ay7zxbuce5-e4mcl8-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets_post: Refreshing state... [id=agmr-ay7zxbuce5-ykp4c4-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals: Refreshing state... [id=agmr-ay7zxbuce5-inzuhj-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-5soaxl-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post: Refreshing state... [id=agmr-ay7zxbuce5-ciik3o-POST-200]
module.sbeacon.aws_api_gateway_method_response.filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-9kn0lk-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-ndrfug-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-5soaxl-POST-200]
module.sbeacon.aws_api_gateway_method_response.map: Refreshing state... [id=agmr-ay7zxbuce5-wrl7bg-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id: Refreshing state... [id=agmr-ay7zxbuce5-e0naw4-GET-200]
module.sbeacon.aws_api_gateway_method_response.dportal_proxy: Refreshing state... [id=agmr-ay7zxbuce5-50q97k-ANY-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-lkcvxt-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets: Refreshing state... [id=agmr-ay7zxbuce5-ykp4c4-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants: Refreshing state... [id=agmr-ay7zxbuce5-90ijb7-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id: Refreshing state... [id=agmr-ay7zxbuce5-ywlhni-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id: Refreshing state... [id=agmr-ay7zxbuce5-3wwe9g-GET-200]
module.sbeacon.aws_api_gateway_method_response.admin_proxy: Refreshing state... [id=agmr-ay7zxbuce5-9dk56a-ANY-200]
module.sbeacon.aws_api_gateway_method_response.g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-e4mcl8-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples_post: Refreshing state... [id=agmr-ay7zxbuce5-qas2rf-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post: Refreshing state... [id=agmr-ay7zxbuce5-36rzlr-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants: Refreshing state... [id=agmr-ay7zxbuce5-gblm3a-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals: Refreshing state... [id=agmr-ay7zxbuce5-rojf3g-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals_post: Refreshing state... [id=agmr-ay7zxbuce5-rojf3g-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-azek1i-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses: Refreshing state... [id=agmr-ay7zxbuce5-a2e61n-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post: Refreshing state... [id=agmr-ay7zxbuce5-a2mxdc-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-1hngs5-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants: Refreshing state... [id=agmr-ay7zxbuce5-nutc2v-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post: Refreshing state... [id=agmr-ay7zxbuce5-ndrfug-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants: Refreshing state... [id=agmr-ay7zxbuce5-a2mxdc-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs: Refreshing state... [id=agmr-ay7zxbuce5-3rhrn1-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses_post: Refreshing state... [id=agmr-ay7zxbuce5-qryfoo-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-lkcvxt-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id_post: Refreshing state... [id=agmr-ay7zxbuce5-ywlhni-POST-200]
module.sbeacon.aws_lambda_permission.APIGetFilteringTerms: Refreshing state... [id=AllowAPIGetFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-9kn0lk-GET]
module.sbeacon.aws_lambda_permission.S3deidentifyFiles: Refreshing state... [id=SBeaconBackendAllowS3deidentifyFilesInvoke]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms: Refreshing state... [id=agmr-ay7zxbuce5-azek1i-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post: Refreshing state... [id=agmr-ay7zxbuce5-k9hee7-POST-200]
module.sbeacon.aws_lambda_permission.APIGetProjects: Refreshing state... [id=AllowAPIGetProjectsInvoke]
module.sbeacon.aws_api_gateway_integration.entry_types: Refreshing state... [id=agi-ay7zxbuce5-nj6imq-GET]
module.sbeacon.aws_api_gateway_integration.projects: Refreshing state... [id=agi-ay7zxbuce5-ktx1hl-GET]
module.sbeacon.aws_lambda_permission.APIGetEntryTypes: Refreshing state... [id=AllowAPIGetEntryTypesInvoke]
module.sbeacon.aws_lambda_permission.APIGetConfiguration: Refreshing state... [id=AllowAPIGetConfigurationInvoke]
module.sbeacon.aws_api_gateway_integration.configuration: Refreshing state... [id=agi-ay7zxbuce5-70wedb-GET]
module.sbeacon.aws_lambda_permission.S3updateFiles: Refreshing state... [id=SBeaconBackendAllowS3updateFilesInvoke]
module.svep[0].aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-osb9nvt4q0-r7yeta-GET-200]
module.sbeacon.aws_api_gateway_integration.map: Refreshing state... [id=agi-ay7zxbuce5-wrl7bg-GET]
module.sbeacon.aws_lambda_permission.APIGetmap: Refreshing state... [id=AllowAPIGetMapInvoke]
module.sbeacon.aws_api_gateway_method_response.biosamples: Refreshing state... [id=agmr-ay7zxbuce5-qas2rf-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs: Refreshing state... [id=agmr-ay7zxbuce5-87mkua-GET-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-osb9nvt4q0-pthst5-POST-200]
module.sbeacon.aws_lambda_permission.APIGetinfo-root: Refreshing state... [id=AllowAPIGetinfoRootInvoke]
module.sbeacon.aws_lambda_permission.APIGetInfo: Refreshing state... [id=AllowAPIGetInfoInvoke]
module.sbeacon.aws_api_gateway_integration.info: Refreshing state... [id=agi-ay7zxbuce5-i68a93-GET]
module.sbeacon.aws_api_gateway_integration.root-get: Refreshing state... [id=agi-ay7zxbuce5-bvg5rk8ca5-GET]
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Read complete after 0s [id=1013636260]
module.sbeacon.aws_sns_topic_subscription.performQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:performQuery:6afadbd5-37e7-4629-8745-c92dc2f170a7]
module.sbeacon.aws_lambda_permission.SNSperformQuery: Refreshing state... [id=SBeaconBackendAllowSNSperformQueryInvoke]
module.svep[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-osb9nvt4q0-hf7iq3-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id_post: Refreshing state... [id=agmr-ay7zxbuce5-rf4u1t-POST-200]
module.svep[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-osb9nvt4q0-hf7iq3-PATCH-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_method._: Refreshing state... [id=agm-ay7zxbuce5-bvg5rk8ca5-OPTIONS]
module.sbeacon.aws_api_gateway_method_response.biosamples-id: Refreshing state... [id=agmr-ay7zxbuce5-rf4u1t-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses: Refreshing state... [id=agmr-ay7zxbuce5-ciik3o-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post: Refreshing state... [id=agmr-ay7zxbuce5-inzuhj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-9kn0lk-GET-200]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-ay7zxbuce5-70wedb-GET-200]
module.sbeacon.aws_s3_bucket_notification.updateFiles: Refreshing state... [id=gasi-dataportal-20250526051709316000000004]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-ay7zxbuce5-wrl7bg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-ay7zxbuce5-i68a93-GET-200]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-ay7zxbuce5-bvg5rk8ca5-GET-200]
module.svep[0].aws_sns_topic_subscription.pluginConsequence: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:svep-backend-pluginConsequence:eb7eb095-efe6-4605-aba9-6481158cae75]
module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission: Refreshing state... [id=SNSPluginConsequenceAllowInvoke]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Reading...
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ay7zxbuce5-bvg5rk8ca5-OPTIONS-200]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Read complete after 0s [id=4032204734]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-ay7zxbuce5-bvg5rk8ca5-OPTIONS]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-ay7zxbuce5-ktx1hl-GET-200]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ay7zxbuce5-bvg5rk8ca5-OPTIONS-200]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-ay7zxbuce5-9dk56a-ANY]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=2389572503]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:565393035713:splitQuery:f0c2a9cc-6414-47df-a59d-33c5b61ef5a2]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=2389572503]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=2389572503]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=2389572503]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=2389572503]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=542087954]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-ay7zxbuce5-9dk56a-ANY-200]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-ay7zxbuce5-50q97k-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-ay7zxbuce5-90ijb7-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-ay7zxbuce5-ciik3o-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-ay7zxbuce5-ciik3o-POST]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-ay7zxbuce5-e0naw4-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-ay7zxbuce5-3rhrn1-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-azek1i-POST]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-ay7zxbuce5-3rhrn1-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-ay7zxbuce5-e0naw4-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-azek1i-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-90ijb7-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-ay7zxbuce5-a2e61n-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-a2mxdc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-ay7zxbuce5-rf4u1t-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-ay7zxbuce5-87mkua-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-ndrfug-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-ay7zxbuce5-a2e61n-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-ay7zxbuce5-a2mxdc-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-ay7zxbuce5-qas2rf-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-ay7zxbuce5-87mkua-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-ay7zxbuce5-qas2rf-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-ndrfug-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-ay7zxbuce5-rf4u1t-GET]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-ay7zxbuce5-ywlhni-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-5soaxl-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-ay7zxbuce5-kf5n4v-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-ay7zxbuce5-ykp4c4-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-5soaxl-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-gblm3a-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-ay7zxbuce5-gblm3a-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-xvn5i1-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-ay7zxbuce5-ykp4c4-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-ay7zxbuce5-inzuhj-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-ay7zxbuce5-inzuhj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-ay7zxbuce5-kf5n4v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-ay7zxbuce5-ywlhni-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-xvn5i1-GET]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-ay7zxbuce5-90ijb7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-ay7zxbuce5-ciik3o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-ay7zxbuce5-ciik3o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-ay7zxbuce5-e0naw4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-ay7zxbuce5-3rhrn1-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-ay7zxbuce5-e0naw4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-ay7zxbuce5-a2e61n-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-ay7zxbuce5-rf4u1t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-ay7zxbuce5-87mkua-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-ndrfug-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-ay7zxbuce5-a2e61n-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-azek1i-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-ay7zxbuce5-qas2rf-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-ay7zxbuce5-3rhrn1-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-ay7zxbuce5-87mkua-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-ay7zxbuce5-qas2rf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-a2mxdc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-90ijb7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-ay7zxbuce5-rf4u1t-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-ay7zxbuce5-kf5n4v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-ay7zxbuce5-ywlhni-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-ay7zxbuce5-ykp4c4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-5soaxl-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-gblm3a-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-xvn5i1-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-ndrfug-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-5soaxl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-ay7zxbuce5-inzuhj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-ay7zxbuce5-kf5n4v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-ay7zxbuce5-50q97k-ANY-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-ay7zxbuce5-gblm3a-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-azek1i-GET-200]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-ay7zxbuce5-zy2tj8-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-lkcvxt-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-ay7zxbuce5-qryfoo-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-ay7zxbuce5-cibxn6-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-ay7zxbuce5-cibxn6-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-lkcvxt-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-zy2tj8-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-ay7zxbuce5-qryfoo-POST]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-ay7zxbuce5-ykp4c4-GET-200]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-ay7zxbuce5-3wwe9g-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-ay7zxbuce5-36rzlr-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-nutc2v-POST]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-ay7zxbuce5-rojf3g-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-ay7zxbuce5-1hngs5-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-ay7zxbuce5-nutc2v-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-ay7zxbuce5-3wwe9g-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-ay7zxbuce5-1hngs5-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-ay7zxbuce5-36rzlr-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-ay7zxbuce5-rojf3g-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-ay7zxbuce5-a2mxdc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-ay7zxbuce5-inzuhj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-ay7zxbuce5-ywlhni-POST-200]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-ay7zxbuce5-9f6czs-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-ay7zxbuce5-k9hee7-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-ay7zxbuce5-e4mcl8-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-ay7zxbuce5-x2xtxj-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-ay7zxbuce5-x2xtxj-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-ay7zxbuce5-9f6czs-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-ay7zxbuce5-k9hee7-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-ay7zxbuce5-e4mcl8-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-ay7zxbuce5-zy2tj8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-lkcvxt-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-ay7zxbuce5-qryfoo-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-lkcvxt-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-ay7zxbuce5-cibxn6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-ay7zxbuce5-qryfoo-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-ay7zxbuce5-cibxn6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-ay7zxbuce5-3wwe9g-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-ay7zxbuce5-36rzlr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-1hngs5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-ay7zxbuce5-xvn5i1-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-ay7zxbuce5-3wwe9g-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-ay7zxbuce5-nutc2v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-ay7zxbuce5-36rzlr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-ay7zxbuce5-rojf3g-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-ay7zxbuce5-rojf3g-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-ay7zxbuce5-9f6czs-GET-200]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-ay7zxbuce5-nj6imq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-e4mcl8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-ay7zxbuce5-x2xtxj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-ay7zxbuce5-x2xtxj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-ay7zxbuce5-k9hee7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-ay7zxbuce5-e4mcl8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-ay7zxbuce5-9f6czs-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-ay7zxbuce5-k9hee7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-nutc2v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-ay7zxbuce5-zy2tj8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-ay7zxbuce5-1hngs5-POST-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-osb9nvt4q0-pthst5-PATCH-200]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=35ztqv]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-osb9nvt4q0-prod]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ZQVRVA84LBB3]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=osb9nvt4q0-prod-*/*]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=zs9x1i]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-ay7zxbuce5-prod]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2XI66QK2KUMEP]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=ay7zxbuce5-prod-*/*]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=03b5417f-ea36-4e3d-9441-bd5c33211bf5]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=EVMOEDSG06UT7]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=3730240267]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250526051651992400000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.sbeacon.module.cors-map.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ay7zxbuce5-wrl7bg-OPTIONS-200]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Read complete after 1m26s [id=-]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_key_parameters    = []
        id                      = "agi-osb9nvt4q0-pthst5-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_key_parameters    = []
        id                      = "agi-osb9nvt4q0-pthst5-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-patch" {
        id                  = "agir-osb9nvt4q0-pthst5-PATCH-200"
      + response_parameters = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-post" {
        id                  = "agir-osb9nvt4q0-pthst5-POST-200"
      + response_parameters = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_aosNqJwGI"
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_aosNqJwGI"
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = "ap-southeast-3_aosNqJwGI"
      + username     = "admin@example.com"
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi (deposed object aa4e5a3c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "BeaconApi" {
      - created_date  = "2025-05-26T05:50:25Z" -> null
      - execution_arn = "arn:aws:execute-api:ap-southeast-3:565393035713:ay7zxbuce5/" -> null
      - id            = "ezblap" -> null
      - invoke_url    = "https://ay7zxbuce5.execute-api.ap-southeast-3.amazonaws.com/" -> null
      - rest_api_id   = "ay7zxbuce5" -> null
      - triggers      = {
          - "redeployment" = "3c12904e5316c5a0507c5f5463244892471c172b"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi must be replaced
+/- resource "aws_api_gateway_deployment" "VPApi" {
      ~ created_date  = "2025-05-26T08:36:28Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-southeast-3:565393035713:osb9nvt4q0/" -> (known after apply)
      ~ id            = "35ztqv" -> (known after apply)
      ~ invoke_url    = "https://osb9nvt4q0.execute-api.ap-southeast-3.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "8c10a7972a664f7766ec9f4b1b325ba368683c66" -> "4384d90f37d419c0c2396e6de7f5ed012b5f1b74"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_stage.VPApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "VPApi" {
      ~ deployment_id         = "35ztqv" -> (known after apply)
        id                    = "ags-osb9nvt4q0-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_cloudfront_distribution.api_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api_distribution" {
        id                              = "E1ZQVRVA84LBB3"
        tags                            = {}
        # (23 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "osb9nvt4q0.execute-api.ap-southeast-3.amazonaws.com" -> null
          - origin_id                = "svep-backend-api" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "svep-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = "eb8e638f5b192a20c8fb0fb9a7b2f14e9c43634a"
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74"
          + "compiled_code_hash" = "eb8e638f5b192a20c8fb0fb9a7b2f14e9c43634a"
        }
    }

Plan: 6 to add, 2 to change, 2 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on pgxflow/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.PgxApi.invoke_url)[2]
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 4 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: hub04-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "hub04-plan.out"
✅ Terraform plan created successfully: hub04-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_key_parameters    = []
        id                      = "agi-osb9nvt4q0-pthst5-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_key_parameters    = []
        id                      = "agi-osb9nvt4q0-pthst5-POST"
      + request_parameters      = {}
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for hub04!

Thank you for using Atlantis Schema Deploy
© May, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-hub04
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-hub04
  ```

**Note: Objects have changed outside of Terraform**
Plan: 6 to add, 2 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```